"""Два различных натуральных числа n и m называются дружественными, 
если сумма делителей числа n (включая 1, но исключая само n) равна 
числу m и наоборот. Например, 220 и 284 – дружественные числа. 
По данному числу k выведите все пары дружественных чисел, 
каждое из которых не превосходит k. Программа получает на вход 
одно натуральное число k, не превосходящее 105. 
Программа должна вывести  все пары дружественных чисел, 
каждое из которых не превосходит k. Пары необходимо выводить 
по одной в строке, разделяя пробелами. Каждая пара должна быть 
выведена только один раз (перестановка чисел новую пару не дает)."""

k = int(input("Число k = "))
numbers_div = []
for i in range(k):
    summa = 0
    for j in range(1, i // 2 + 1):
        if i % j == 0:
            summa += j
    numbers_div.append(tuple([i, summa]))

print(numbers_div)
(220, 284), (284, 220)
for i in range(len(numbers_div)):
    for j in range(i, len(numbers_div)):
        if i != j and numbers_div[i][0] == numbers_div[j][1] and numbers_div[i][1] == numbers_div[j][0]:
            print(*numbers_div[i])
